FemDesign.Bars.Eccentricity
ecc_value_type
This class called Eccentricity as it is the Dynamo facing class.

FemDesign.Bars.Eccentricity.X
Eccentricity local-x. Sign convention of value as defined in FEM-Design GUI. Note that the value defined here will be negated in the generated .struxml file based on the data-protocol.

FemDesign.Bars.Eccentricity._y
Private field for eccentricity of local-y

FemDesign.Bars.Eccentricity.Y
Eccentricity local-y. Sign convention of value as defined in FEM-Design GUI. Note that the value defined here will be negated in the generated .struxml file based on the data-protocol.

FemDesign.Bars.Eccentricity._z
Private field for eccentricity of local-z

FemDesign.Bars.Eccentricity.Z
Eccentricity local-z. Sign convention of value as defined in FEM-Design GUI. Note that the value defined here will be negated in the generated .struxml file based on the data-protocol.

FemDesign.Bars.Eccentricity.#ctor
Parameterless constructor for serialization.

FemDesign.Bars.Eccentricity.#ctor(System.Double,System.Double)
Constructor for eccentricity object used for bar-eccentricity definition. Sign convention of values as defined in FEM-Design GUI. Note that the value defined here will be negated in the generated .struxml file based on the data-protocol.
y: Eccentricity local-y.
z: Eccentricity local-z.

FemDesign.Bars.Eccentricity.Default
Create a default eccentricity, i.e. no ecceentricity (y=z=0).
Remarks: Create
Returns: